================================================================================
with ; comment
================================================================================
; hello

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment)))

================================================================================
with # comment
================================================================================
# hello

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment)))

================================================================================
with % comment
================================================================================
% hello

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment)))

================================================================================
with | comment
================================================================================
| hello

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment)))

================================================================================
with * comment
================================================================================
* hello

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment)))

================================================================================
with empty block comment
================================================================================
comment
end comment

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (block_comment)))

================================================================================
with block comment
================================================================================
comment
  This is a block comment with
  multiple lines
end comment

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (block_comment)))

================================================================================
with block comment Starting at the beginning of the line
================================================================================
comment
This is a block comment with
multiple lines
end comment

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (block_comment)))

================================================================================
with text after block comment begin
================================================================================
comment This is a comment
This is a block comment with
multiple lines
end comment

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (block_comment)))

================================================================================
notes
================================================================================
2020-12-01 Something  ; title note
    ; some note
    Expenses:Food:Groceries                21.36 EUR ; asdfsadf
    ; another note
    Assets:Bank:Checking

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (xact
      (plain_xact
        (date)
        (payee)
        (note)
        (posting
          (account)
          (amount
            (quantity)
            (commodity))
          (note))
        (note)
        (posting
          (account))))))

================================================================================
multiple comments
================================================================================
; something
* something

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment))
  (journal_item
    (comment)))

================================================================================
blank lines
================================================================================

; comment

* comment

--------------------------------------------------------------------------------

(source_file
  (journal_item
    (comment))
  (journal_item
    (comment)))

